-- Let us take care of exercises related to filtering and aggregations using SQL.

-- * Get all the details of the courses which are in `inactive` or `draft` state.

-- * Get all the details of the courses which are related to `Python` or `Scala`.

-- * Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.

-- * Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.

-- * Get all the details of `Python` or `Scala` related courses in `draft` status.

-- * Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.

# 93. Simple Exercises for Filtering and Aggregations

In [3]:
%%sql
SELECT * FROM courses;

,course_id,course_name,course_author,course_status,course_published_dt
0,1,Programming using Python,Bob Dillon,published,2020-09-30
1,2,Data Engineering using Python,Bob Dillon,published,2020-07-15
2,3,Data Engineering using Scala,Elvis Presley,draft,NaN
3,4,Programming using Scala,Elvis Presley,published,2020-05-12
4,5,Programming using Java,Mike Jack,inactive,2020-08-10
5,6,Web Applications - Python Flask,Bob Dillon,inactive,2020-07-20
6,7,Web Applications - Java Spring,Bob Dillon,draft,NaN
7,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN
8,9,Streaming Pipelines - Python,Bob Dillon,published,2020-10-05
9,10,Web Applications - Scala Play,Elvis Presley,inactive,2020-09-30
10,11,Web Applications - Python Django,Bob Dillon,published,2020-06-23
11,12,Server Automation - Ansible,Uncle Sam,published,2020-07-05

# Get all the details of the courses which are in `inactive` or `draft` state.

In [5]:
%%sql
SELECT * FROM courses
WHERE course_status IN ('draft', 'inactive')

,course_id,course_name,course_author,course_status,course_published_dt
0,3,Data Engineering using Scala,Elvis Presley,draft,NaN
1,5,Programming using Java,Mike Jack,inactive,2020-08-10
2,6,Web Applications - Python Flask,Bob Dillon,inactive,2020-07-20
3,7,Web Applications - Java Spring,Bob Dillon,draft,NaN
4,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN
5,10,Web Applications - Scala Play,Elvis Presley,inactive,2020-09-30

# Get all the details of the courses which are related to `Python` or `Scala`.

In [13]:
%%sql
SELECT * FROM courses
WHERE course_name LIKE '%Scala%'
   OR course_name LIKE '%Python%'

,course_id,course_name,course_author,course_status,course_published_dt
0,1,Programming using Python,Bob Dillon,published,2020-09-30
1,2,Data Engineering using Python,Bob Dillon,published,2020-07-15
2,3,Data Engineering using Scala,Elvis Presley,draft,NaN
3,4,Programming using Scala,Elvis Presley,published,2020-05-12
4,6,Web Applications - Python Flask,Bob Dillon,inactive,2020-07-20
5,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN
6,9,Streaming Pipelines - Python,Bob Dillon,published,2020-10-05
7,10,Web Applications - Scala Play,Elvis Presley,inactive,2020-09-30
8,11,Web Applications - Python Django,Bob Dillon,published,2020-06-23

# Get count of courses by `course_status`. The output should contain `course_status` and `course_count`.

In [15]:
%%sql
SELECT course_status, count(*) FROM courses
GROUP BY course_status;

  course_status  count
0     published      6
1      inactive      3
2         draft      3

# Get count of `published` courses by `course_author`. The output should contain `course_author` and `course_count`.

In [18]:
%%sql
SELECT  course_author, count(*) FROM courses
WHERE course_status = 'published'
GROUP BY course_author;

   course_author  count
0     Bob Dillon      4
1  Elvis Presley      1
2      Uncle Sam      1

# Get all the details of `Python` or `Scala` related courses in `draft` status.

In [21]:
%%sql
SELECT * FROM courses
WHERE (course_name LIKE '%Scala%'
  OR course_name LIKE '%Python%')
  AND course_status = 'draft'

,course_id,course_name,course_author,course_status,course_published_dt
0,3,Data Engineering using Scala,Elvis Presley,draft,NaN
1,8,Pipeline Orchestration - Python,Bob Dillon,draft,NaN

# Get the author and count where the author have more than **one published** course. The output should contain `course_author` and `course_count`.

In [23]:
%%sql
SELECT courses.course_author, count(*)
FROM courses
GROUP BY course_author
HAVING count(*) > 1;

   course_author  count
0     Bob Dillon      7
1  Elvis Presley      3

# # 94. Exercises on Joins and Aggregations using SQL

# Exercise 1 - Customer order count

In [13]:
%%sql
SELECT customer_id,
       customer_fname,
       customer_lname,
       count(*)
FROM customers c
    JOIN orders o
      ON c.customer_id = o.order_customer_id
        WHERE to_char(order_date, 'yyyy-mm') = '2014-01'
        GROUP BY to_char(order_date, 'yyyy-mm'), customer_id
        ORDER BY customer_id DESC;

      customer_id customer_fname customer_lname  count
0           12432         Angela          Smith      1
1           12431           Mary           Rios      4
2           12430         Hannah          Brown      1
3           12427           Mary          Smith      1
4           12426         Jordan         Valdez      1
...           ...            ...            ...    ...
4691           15           Jane           Luna      1
4692           14      Katherine          Smith      1
4693           13           Mary        Baldwin      1
4694            8          Megan          Smith      2
4695            7        Melissa         Wilcox      4

[4696 rows x 4 columns]

# Exercise 2 - Dormant Customers

In [19]:
%%sql
SELECT c.*
FROM customers c
    LEFT JOIN orders o
      ON c.customer_id = o.order_customer_id
      AND to_char(order_date, 'yyyy-mm') = '2014-01'
      WHERE o.order_customer_id IS NULL
      ORDER BY c.customer_id;

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,XXXXXXXXX,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,XXXXXXXXX,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,XXXXXXXXX,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,XXXXXXXXX,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,XXXXXXXXX,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725
...,...,...,...,...,...,...,...,...,...
7734,12428,Jeffrey,Travis,XXXXXXXXX,XXXXXXXXX,1552 Burning Dale Highlands,Caguas,PR,725
7735,12429,Mary,Smith,XXXXXXXXX,XXXXXXXXX,92 Sunny Bear Villas,Gardena,CA,90247
7736,12433,Benjamin,Garcia,XXXXXXXXX,XXXXXXXXX,5459 Noble Brook Landing,Levittown,NY,11756
7737,12434,Mary,Mills,XXXXXXXXX,XXXXXXXXX,9720 Colonial Parade,Caguas,PR,725
7738,12435,Laura,Horton,XXXXXXXXX,XXXXXXXXX,5736 Honey Downs,Summerville,SC,29483

# # Exercise 3 - Revenue Per Customer